<?php
function translit($str)
{
    static $tr = null;
    static $pattern = null;
    
    if ($tr === null) {
        // массив 
        $tr = [
            'А' => 'A', 'Б' => 'B', 'В' => 'V', 'Г' => 'G',
            'Д' => 'D', 'Е' => 'E', 'Ё' => 'E', 'Є' => 'E',
            'Ж' => 'J', 'З' => 'Z', 'И' => 'I', 'Й' => 'Y',
            'К' => 'K', 'Л' => 'L', 'М' => 'M', 'Н' => 'N',
            'О' => 'O', 'П' => 'P', 'Р' => 'R', 'С' => 'S',
            'Т' => 'T', 'У' => 'U', 'Ф' => 'F', 'Х' => 'H',
            'Ц' => 'TS', 'Ч' => 'CH', 'Ш' => 'SH', 'Щ' => 'SCH',
            'Ъ' => '', 'Ы' => 'YI', 'Ь' => '', 'Э' => 'E',
            'Ю' => 'YU', 'Я' => 'YA', 'Ї' => 'YI',
            'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g',
            'д' => 'd', 'е' => 'e', 'ё' => 'e', 'є' => 'e',
            'ж' => 'j', 'з' => 'z', 'и' => 'i', 'й' => 'y',
            'к' => 'k', 'л' => 'l', 'м' => 'm', 'н' => 'n',
            'о' => 'o', 'п' => 'p', 'р' => 'r', 'с' => 's',
            'т' => 't', 'у' => 'u', 'ф' => 'f', 'х' => 'h',
            'ц' => 'ts', 'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sch',
            'ъ' => 'y', 'ы' => 'yi', 'ь' => '', 'э' => 'e',
            'ю' => 'yu', 'я' => 'ya', 'ї' => 'yi',
            ' ' => '_', '/' => '_'
        ];
        
        $pattern = '/[^A-Za-z0-9_\-.]/';
    }
    
    // проверка
    if (strpbrk($str, 'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяЄЇ /') === false) {
        return $str;
    }
    
    $result = strtr($str, $tr);
    return preg_replace($pattern, '', $result);
}